; -------------------------------------------------------------------
; CCP
; -------------------------------------------------------------------
; 中国共産党
; COSアプリケーションはCCPを食いつぶすことがあり、ウォームブートでカードからリロードされる
; つまり特権的地位を持つかもしれないCOSアプリケーションである
; -------------------------------------------------------------------
.INCLUDE "FXT65.inc"
.INCLUDE "generic.mac"
.PROC BCOS
  .INCLUDE "syscall.inc"  ; システムコール番号
.ENDPROC

; -------------------------------------------------------------------
;                             変数領域
; -------------------------------------------------------------------
.ZEROPAGE

.SEGMENT "COMBSS"
CUR_DIR:          .RES 64 ; カレントディレクトリのパスが入る。二行分でアボン

; -------------------------------------------------------------------
;                             実行領域
; -------------------------------------------------------------------
.SEGMENT "COMCODE"
; -------------------------------------------------------------------
;                           シェルスタート
; -------------------------------------------------------------------
START:
  loadAY16 STR_INITMESSAGE
  LDX #BCOS::CON_OUT_STR*2
  JSR BCOS::SYSCALL               ; タイトル表示

LOOP:
  LDA #'>'
  LDX #BCOS::CON_OUT_CHR*2
  JSR BCOS::SYSCALL               ; プロンプト表示
  LDX #BCOS::CON_IN_CHR*2         ; 1文字入力
  JSR BCOS::SYSCALL
  CMP #$03                        ; CTRL+C？
  BEQ EXT                         ; CTRL+C入力により死亡
  JSR PRT_LF
  BRA LOOP

EXT:
  BRK

PRT_LF:
  ; 改行
  LDA #$A
  LDX #BCOS::CON_OUT_CHR*2
  JSR BCOS::SYSCALL
  RTS

; -------------------------------------------------------------------
;                             データ領域
; -------------------------------------------------------------------
STR_INITMESSAGE:  .BYT "MIRACOS 0.01 for FxT-65",$A,$A,$0 ; 起動時メッセージ
PATH_DEFAULT:     .BYT "A:/"

