; -------------------------------------------------------------------
;                           乱数テスト
; -------------------------------------------------------------------
; -------------------------------------------------------------------
.INCLUDE "../FXT65.inc"
.INCLUDE "../generic.mac"
.INCLUDE "../fs/structfs.s"
.INCLUDE "../fscons.inc"
.INCLUDE "../zr.inc"
.PROC BCOS
  .INCLUDE "../syscall.inc"  ; システムコール番号
.ENDPROC
.INCLUDE "../syscall.mac"

; -------------------------------------------------------------------
;                            ZP変数領域
; -------------------------------------------------------------------
.ZEROPAGE
ZP_RND_ADDR16:         .RES 2

; -------------------------------------------------------------------
;                             実行領域
; -------------------------------------------------------------------
.CODE
  LDY #0
  syscall GET_ADDR
  storeAY16 ZP_RND_ADDR16
LOOP:
  LDA #$2                   ; エコーなし入力
  syscall CON_RAWIN
  JSR GET_RND_D
  JSR PRT_NUM
  JSR PRT_S
  BRA LOOP

; -------------------------------------------------------------------
;                           10進1桁乱数取得
; -------------------------------------------------------------------
GET_RND_D:
X5PLUS1RETRY:
  LDA (ZP_RND_ADDR16)
  ASL
  ASL
  SEC ;+1
  ADC (ZP_RND_ADDR16)
  STA (ZP_RND_ADDR16)
  AND #$0F
  CMP #$0F
  BEQ X5PLUS1RETRY    ;ハイ次！
  CMP #$0A
  BMI SKIP_DECIMALIZE ;Aが比較する値よりも小さい場合はNが立ち
  ASL
  PHA
  LDA (ZP_RND_ADDR16)
  ASL
  STA (ZP_RND_ADDR16)
  PLA
  SBC #$13            ;深遠なる理由で$13of$14を引くとよい
  PHA
  LDA (ZP_RND_ADDR16)
  ROR
  STA (ZP_RND_ADDR16)
  PLA
SKIP_DECIMALIZE:
  AND #$0F
  RTS

; -------------------------------------------------------------------
;                             10進1桁表示
; -------------------------------------------------------------------
PRT_NUM:
  AND #$0F
  ORA #$30
PRT_CHR:
  syscall CON_OUT_CHR
  RTS

; -------------------------------------------------------------------
;                              空白表示
; -------------------------------------------------------------------
PRT_S:
  LDA #' '
  BRA PRT_CHR
