; -------------------------------------------------------------------
;                              TEST_CIC
; -------------------------------------------------------------------
; CON_INTERRUPT_CHR による文字入力キューへの文字投入のテストプログラム
; -------------------------------------------------------------------
.INCLUDE "../generic.mac"    ; 汎用マクロ
.PROC BCOS
  .INCLUDE "../syscall.inc"  ; システムコール番号定義
.ENDPROC
.INCLUDE "../syscall.mac"    ; 簡単システムコールマクロ

.ZEROPAGE
ZP_STRPTR:  .RES 2

; -------------------------------------------------------------------
;                             実行領域
; -------------------------------------------------------------------
.CODE
START:
  loadAY16 STR_HELLO         ; 文字列のポインタをレジスタにロード
  JSR _system
  RTS                        ; 呼び出し元（シェル）に返る

; -------------------------------------------------------------------
;                             データ領域
; -------------------------------------------------------------------
STR_HELLO: .BYT "hello, world",$0
;STR_HELLO: .ASCIIZ "hell!!!!"

; -------------------------------------------------------------------
; void system(unsigned char* commandline)
; -------------------------------------------------------------------
_system:
  storeAY16 ZP_STRPTR
  LDY #0
@LOOP:
  LDA (ZP_STRPTR),Y
  BEQ @END
  PHY
  syscall CON_INTERRUPT_CHR
  PLY
  INY
  BRA @LOOP
@END:
  JMP $5000

