; -------------------------------------------------------------------
; CAT
; -------------------------------------------------------------------
; ねこ
; -------------------------------------------------------------------
.INCLUDE "../FXT65.inc"
.INCLUDE "../generic.mac"
.INCLUDE "../fs/structfs.s"
.INCLUDE "../fscons.inc"
.PROC BCOS
  .INCLUDE "../syscall.inc"  ; システムコール番号
.ENDPROC
.INCLUDE "../syscall.mac"

; -------------------------------------------------------------------
;                             実行領域
; -------------------------------------------------------------------
.CODE
START:
  loadAY16 STR_HELLO
  syscall CON_OUT_STR
  RTS                             ; BCOS0でも等価でありたいが現状そうでないのでリターン

STR_HELLO:
  .INCBIN "cat.txt"
  .BYT $B3,$9C,$96,$9C,$A3,$3A,$20,$74,$79,$70,$65,$20,$DA,$EF,$FD,$E4,$BE
  .BYT $A,$0

