; -------------------------------------------------------------------
;                           HELLOコマンド
; -------------------------------------------------------------------
; トランジェントコマンドの雛形
; -------------------------------------------------------------------
.INCLUDE "../generic.mac"    ; 汎用マクロ
.PROC BCOS
  .INCLUDE "../syscall.inc"  ; システムコール番号定義
.ENDPROC
.INCLUDE "../syscall.mac"    ; 簡単システムコールマクロ

; -------------------------------------------------------------------
;                             実行領域
; -------------------------------------------------------------------
.CODE
START:
  loadAY16 STR_HELLO         ; 文字列のポインタをレジスタにロード
  syscall CON_OUT_STR        ; 文字列を出力
  RTS                        ; 呼び出し元（シェル）に返る

; -------------------------------------------------------------------
;                             データ領域
; -------------------------------------------------------------------
STR_HELLO: .BYT "hello, world",$A,$0
;STR_HELLO: .ASCIIZ "hell!!!!"

